codes_by_phrase = {
    'австралийский доллар': 'AUD',
    'австралийского доллара': 'AUD',

    'азербайджанский манат': 'AZN',
    'азербайджанского маната': 'AZN',

    'армянский драм': 'AMD',
    'армянского драма': 'AMD',
    'драм': 'AMD',
    'драма': 'AMD',

    'белорусский рубль': 'BYN',
    'белорусского рубля': 'BYN',

    'болгарский лев': 'BGN',
    'болгарского лева': 'BGN',
    'лев': 'BGN',
    'лева': 'BGN',

    'бразильский реал': 'BRL',
    'бразильского реала': 'BRL',
    'реал': 'BRL',
    'реала': 'BRL',

    'венгерский форинт': 'HUF',
    'венгерского форинта': 'HUF',
    'форинт': 'HUF',
    'форинта': 'HUF',

    'вон республики корея': 'KRW',
    'вона республики корея': 'KRW',
    'воны республики корея': 'KRW',
    'вон': 'KRW',
    'вона': 'KRW',
    'воны': 'KRW',

    'вьетнамский донг': 'VND',
    'вьетнамского донга': 'VND',
    'донг': 'VND',
    'донга': 'VND',

    'гонконгский доллар': 'HKD',
    'гонконгского доллара': 'HKD',

    'грузинский лари': 'GEL',
    'грузинского лари': 'GEL',
    'лари': 'GEL',

    'датская крона': 'DKK',
    'датской кроны': 'DKK',

    'дирхам оаэ': 'AED',
    'дирхама оаэ': 'AED',
    'дирхам': 'AED',
    'дирхама': 'AED',

    'доллар сша': 'USD',
    'доллара сша': 'USD',
    'доллар': 'USD',
    'доллара': 'USD',

    'евро': 'EUR',

    'египетский фунт': 'EGP',
    'египетского фунта': 'EGP',

    'индийская рупия': 'INR',
    'индийской рупии': 'INR',
    'рупия': 'INR',
    'рупии': 'INR',

    'индонезийская рупия': 'IDR',
    'индонезийской рупии': 'IDR',

    'казахстанский тенге': 'KZT',
    'казахстанского тенге': 'KZT',
    'тенге': 'KZT',

    'канадский доллар': 'CAD',
    'канадского доллара': 'CAD',

    'катарский риал': 'QAR',
    'катарского риала': 'QAR',

    'киргизский сом': 'KGS',
    'киргизского сома': 'KGS',
    'сом': 'KGS',
    'сома': 'KGS',

    'китайский юань': 'CNY',
    'китайского юаня': 'CNY',
    'юань': 'CNY',
    'юаня': 'CNY',

    'молдавский лей': 'MDL',
    'молдавского лея': 'MDL',

    'новозеландский доллар': 'NZD',
    'новозеландского доллара': 'NZD',

    'новый туркменский манат': 'TMT',
    'нового туркменского маната': 'TMT',

    'норвежская крона': 'NOK',
    'норвежской кроны': 'NOK',

    'польский злотый': 'PLN',
    'польского злотого': 'PLN',
    'злотый': 'PLN',
    'злотого': 'PLN',

    'румынский лей': 'RON',
    'румынского лея': 'RON',

    'сдр (специальные права заимствования)': 'XDR',
    'сдр': 'XDR',

    'сербский динар': 'RSD',
    'сербского динара': 'RSD',
    'динар': 'RSD',
    'динара': 'RSD',

    'сингапурский доллар': 'SGD',
    'сингапурского доллара': 'SGD',

    'таджикский сомони': 'TJS',
    'таджикского сомони': 'TJS',
    'сомони': 'TJS',

    'таиландский бат': 'THB',
    'таиландского бата': 'THB',
    'бат': 'THB',

    'турецкая лира': 'TRY',
    'турецкой лиры': 'TRY',
    'лира': 'TRY',
    'лиры': 'TRY',

    'узбекский сум': 'UZS',
    'узбекского сума': 'UZS',
    'сум': 'UZS',
    'сума': 'UZS',

    'украинская гривна': 'UAH',
    'украинской гривны': 'UAH',
    'гривна': 'UAH',
    'гривны': 'UAH',

    'фунт стерлингов соединенного королевства': 'GBP',
    'фунта стерлингов соединенного королевства': 'GBP',
    'фунт стерлингов': 'GBP',
    'фунта стерлингов': 'GBP',
    'фунт': 'GBP',
    'фунта': 'GBP',

    'чешская крона': 'CZK',
    'чешской кроны': 'CZK',

    'шведская крона': 'SEK',
    'шведской кроны': 'SEK',

    'швейцарский франк': 'CHF',
    'швейцарского франка': 'CHF',
    'франк': 'CHF',
    'франка': 'CHF',

    'южноафриканский рэнд': 'ZAR',
    'южноафриканского рэнда': 'ZAR',
    'рэнд': 'ZAR',
    'рэнда': 'ZAR',

    'японская иена': 'JPY',
    'японской иены': 'JPY',
    'японская йена': 'JPY',
    'японской йены': 'JPY',
    'иена': 'JPY',
    'иены': 'JPY',
    'йена': 'JPY',
    'йены': 'JPY',
}
